Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: However, Topaz provided valuable insights to the next version of Perl and its implementation, but was ultimately abandoned.
es: La experiencia proporcionada por Topaz resultó muy útil para la siguiente versión de Perl y su implementación, pero el proyecto acabó por abandonarse.

source: However, Unicode is in the process of reconsidering and revising their recommendations.
es: Sin embargo, el consorcio Unicode está reconsiderando y revisando sus recomendaciones.

source: However, a tiny change to this pattern
es: Sin embargo, con un pequeño cambio en este patrón

source: However, as soon as the matching engine sees that there's no whitespace following the "Foo" that it had saved in $1, it realizes its mistake and starts over again one character after where it had the tentative match.
es: Sin embargo, tan pronto como el motor de coincidencias ve que no hay espacio en blanco después de la instancia de "Come" que había guardado en $1, se da cuenta de su error y comienza de nuevo un carácter después de donde había intentado coincidir.

source: However, be aware this will delete ALL untracked content.
es: Sin embargo, tenga en cuenta que esto eliminará TODO el contenido sin seguimiento.

source: However, if you use one of our other recommended OO modules, you can still use roles with L<Role::Tiny>
es: Si usa alguno de los otros módulos de orientación a objetos recomendados, también podrá usar roles con L<Role::Tiny>

source: However, if that class or any of its parent classes defines an C<AUTOLOAD> method, that C<AUTOLOAD> method is called instead.
es: Sin embargo, si la clase (o cualquiera de sus clases primarias) define un método C<AUTOLOAD>, entonces se llamará a ese método.

source: However, if there is no such group, it will take virtually forever on a long string.
es: Sin embargo, si no existe tal grupo y la cadena es muy larga, tardará un tiempo casi infinito.

source: However, if you do happen to know which Perl functions are really syscalls, you can predict which of these will set the C<$!> (C<$ERRNO>) variable on failure.
es: Sin embargo, si sabe qué funciones de Perl son realmente llamadas de sistema, puede predecir cuál de estas establecerá el valor de la variable C<$!> (C<$ERRNO>) cuando se produzca un error.

source: However, if you get into the habit of doing that, you get yourself into trouble if you then add an C</e> modifier.
es: Sin embargo, si se acostumbra a esto, tendrá problemas al agregar un modificador C</e>.

source: However, if your destructor is running inside an C<eval {}> block, then the error will change the value of C<$@>.
es: Sin embargo, si el destructor se ejecuta dentro de un bloque C<eval {}>, el error cambiará el valor de C<$@>.

source: However, in Perl v5.18, it is planned to issue a deprecation warning for all such occurrences, and in Perl v5.20 to require literal uses of a curly bracket to be escaped, say by preceding them with a backslash or enclosing them within square brackets, (C<"\{"> or C<"[{]">).
es: Sin embargo, en Perl v5.18 está previsto que emita una advertencia de obsolescencia para todos estos casos, y en Perl v5.20 que exija que el uso literal de una llave se marque con un carácter de escape, por ejemplo, precediendo la llave con una barra diagonal inversa o escribiéndola entre corchetes, (C<"\{"> o C<"[{]">).

source: However, in a typical regular expression these elementary pieces are combined into more complicated patterns using combining operators C<ST>, C<S|T>, C<S*> etc. (in these examples C<S> and C<T> are regular subexpressions).
es: Sin embargo, en una expresión regular típica, estas partes elementales se combinan en patrones más complicados mediante los operadores de combinación C<ST>, C<S|T>, C<S*>, etc. (en estos ejemplos, C<S> y C<T> son subexpresiones regulares).

source: However, in short:
es: Se incluye a continuación un resumen:

source: However, interpolating a regex into a larger regex would ignore the original compilation in favor of whatever was in effect at the time of the second compilation.
es: Sin embargo, la interpolación de una expresión regular en una expresión regular más grande ignoraría la compilación original en favor de lo que estaba en vigor en el momento de la segunda compilación.

source: However, it's possible to bless any type of data structure or referent, including scalars, globs, and subroutines.
es: Sin embargo, es posible bendecir cualquier tipo de estructura de datos o referente, incluidos escalares, globs y subrutinas.

source: However, keep C<warn> and C<die> in place for your sanity checks - where it really is your module at fault.
es: Sin embargo, mantenga las instrucciones C<warn> y C<die> necesarias para realizar comprobaciones (para los casos en que la culpa la tenga realmente su módulo).

source: However, long experience has shown that many programming tasks may be significantly simplified by using repeated subexpressions that may match zero-length substrings.
es: Sin embargo, la experiencia demuestra que muchas de las tareas de programación se pueden simplificar considerablemente mediante el uso de subexpresiones repetidas que coincidan con subcadenas de longitud cero.

source: However, matches that would cross the Unicode rules/non-Unicode rules boundary (ords 255/256) will not succeed.
es: Sin embargo, no se detectarán coincidencias que atraviesen los límites de las reglas de Unicode/no Unicode (ordinales 255/256).

source: However, most OO modules on CPAN use a method named C<new()> to construct a new object:
es: Sin embargo, la mayoría de los módulos orientados a objetos disponibles en CPAN usan el método C<new()> para construir un objeto nuevo:

source: However, on earlier Perls, or if you pass strings to subroutines outside the feature's scope, you can force Unicode semantics by changing the encoding to UTF-8 by doing C<utf8::upgrade($string)>.
es: Sin embargo, en versiones anteriores de Perl, o si pasa cadenas a subrutinas fuera del ámbito del pragma C<feature>, puede forzar el uso de semántica Unicode cambiando la codificación a UTF-8 mediante C<utf8::upgrade($cadena)>.

source: However, only double quotes "interpolate" variables and special characters such as newlines (C<\n>):
es: Sin embargo las variables y los caracteres especiales, como los caracteres de nueva línea (C<\n>), solo se "interpolan" con comillas dobles:

source: However, since I am running a very recent Hurd snapshot, in which a lot of bugs that were exposed by the Perl test suite have been fixed, you may encounter more failures.
es: Sin embargo, como estoy ejecutando una instantánea muy reciente de Hurd, en la que se han corregido muchos de los errores expuestos por el conjunto de pruebas de Perl, es posible que otros usuarios encuentren más errores.

source: However, that doesn't keep us from calculating how large a patch could have been.
es: Sin embargo, esto no nos impide calcular cuánto hubiera ocupado un parche.

source: However, the C<$_[0]> variable will be read-only in the destructor, so you cannot assign a value to it.
es: Pero la variable C<$_[0]> será de solo lectura en el destructor, por lo que no se le puede asignar un valor.

source: However, the above usage will create global variables throughout your program, which is bad programming practice.
es: Sin embargo, el uso anterior creará variables globales en todo el programa, algo que no se recomienda en programación.

source: However, the notes on preparing the Perl side of the module and packaging and distributing it will apply equally well to an XS module as a pure-Perl one.
es: Sin embargo, las notas sobre cómo preparar la parte Perl del módulo y la forma de empaquetarlo para su distribución se aplican tanto a un módulo XS como a un módulo Perl puro.

source: However, there is a clever way of making your one-line conditional blocks more English like:
es: Sin embargo, puede escribir los bloques condicionales de una sola línea de manera que recuerden a una frase en inglés:

source: However, this isn't the length of the array; it's the subscript of the last element, which is a different value since there is ordinarily a 0th element.
es: Sin embargo, esto no es el número de elementos del array, sino el subíndice del último elemento, que es un valor distinto, ya que normalmente hay un elemento número 0.

source: However, this behaviour is sometimes undesirable.
es: Sin embargo, a veces este comportamiento no es el deseado.

source: However, this bug (L<[perl #89774]|https://rt.perl.org/rt3/Ticket/Display.html?id=89774>) causes it to only match a single "s", even if the final larger match fails, and matching the double "ss" would have succeeded.
es: Sin embargo, un error (L<[perl #89774]|https://rt.perl.org/rt3/Ticket/Display.html?id=89774>) hace que detecte una sola "s", aunque no se detecte una coincidencia final más grande (y, por tanto, fuera posible detectar "ss").

source: However, this description is too low-level and makes you think in terms of a particular implementation.
es: Sin embargo, esta descripción es de muy bajo nivel y hace pensar en términos de una implementación concreta.

source: However, variables and functions named with a single C<_>, such as $_ and C<sub _>, are still forced into the package C<main>.
es: Sin embargo, aún se fuerza la asignación al paquete C<main> de los nombres de variables y funciones con un único guión bajo (C<_>), como $_ y C<sub_>.

source: However, we encourage you to avoid using it in new code.
es: Sin embargo, recomendamos que no la use en el código nuevo.

source: However, we rarely speak strictly and will often refer to the reference-counting scheme as a form of garbage collection.
es: Sin embargo, raramente hablamos en un sentido estricto y nos referiremos habitualmente al esquema de recuento de referencias como una forma de recolección de elementos no deseados.

source: However, you may see this as a way to provide accessors in older Perl code.
es: Sin embargo, puede encontrar esta forma de proporcionar métodos de acceso en código Perl antiguo.

source: However, you should really not look at the flag, and nothing indicates that Data::Dumper should break this rule.
es: Sin embargo, no se debe mirar la marca, y no hay ninguna razón para que Data::Dumper sea una excepción a esta norma.

source: Hugo 5.9.0 2003-Oct-27 281 168 7132 From 5.8.0
es: Hugo 5.9.0 2003-Oct-27 281 168 7132 Desde 5.8.0

source: Hugo 5.9.0 2003-Oct-27 The 5.9 development track
es: Hugo 5.9.0 2003-Oct-27 Serie de desarrollo de v5.9

source: I'd suggest starting with L<Text::Tabs|Text::Tabs>, since it's in the standard library and is nice and simple, and then looking at something a little more complex like L<File::Copy|File::Copy>.
es: Es recomendable empezar con L<Text::Tabs|Text::Tabs> (un módulo interesante y sencillo disponible en la biblioteca estándar) y después pasar a algo un poco más complejo, como L<File::Copy|File::Copy>.

source: I<Mastering Regular Expressions> by Jeffrey Friedl, published by O'Reilly and Associates.
es: I<Mastering Regular Expressions> de Jeffrey Friedl, publicado por O'Reilly and Associates.

source: I<Native> here means "a format supported by the C compiler which was used to build perl".
es: Aquí I<nativo> significa "formato admitido por el compilador de C que se usó para compilar perl".

source: I<i.e.>, where C<use myint;> is in effect, addition operations are forced to integer, whereas by default they are not, with the default behaviour being restored via C<no myint;>
es: Es decir, cuando C<use entero;> esté activo debe modificarse el comportamiento predeterminado de las operaciones de suma forzando la conversión del resultado a un valor entero. Para restablecer el comportamiento predeterminado se usa C<no entero;>

source: I<name> must not begin with a number, nor contain hyphens.
es: I<nombre> no debe comenzar con un número, ni contener guiones.

# INIT blocks run FIFO just before runtime. " }
source: INIT blocks run FIFO just before runtime.\n" }
es: Los bloques INIT se ejecutan en orden FIFO antes del tiempo de ejecución.\n" }

source: INSTALL
es: INSTALAR

source: ISBN 0-201-11889-0 [January 1988]
es: ISBN 0-201-11889-0 [Enero de 1988]

source: ISBN 0-201-61571-1 [1st edition 2001]
es: ISBN 0-201-61571-1 [1ª edición - 2001]

source: ISBN 0-321-49694-9 [2nd edition 2010]
es: ISBN 0-321-49694-9 [2ª edición - 2010]

source: ISBN 0-596-10206-2 [1st edition March 2006]
es: ISBN 0-596-10206-2 [1ª edición - Marzo de 2006]

source: ISBN 1-56592-243-3 [2nd edition August 2003]
es: ISBN 1-56592-243-3 [2ª edición - Agosto de 2003]

source: ISBN 1-59059-018-X [1st edition August 2002]
es: ISBN 1-59059-018-X [1ª edición - Agosto de 2002]

source: ISBN 1-59059-097-X [1st edition July 2003]
es: ISBN 1-59059-097-X [1ª edición - Julio de 2003]

source: ISBN 1-59059-391-X [3rd edition April 2010]
es: ISBN 1-59059-391-X [3ª edición - Abril de 2010]

source: ISBN 1-59059-454-1 [1st edition July 2005]
es: ISBN 1-59059-454-1 [1ª edición - Julio de 2005]

source: ISBN 1-884777-79-1 [1st edition August 1999]
es: ISBN 1-884777-79-1 [1ª edición - Agosto de 1999]

source: ISBN 1-930110-00-6 [1st edition 2001]
es: ISBN 1-930110-00-6 [1ª edición - 2001]

source: ISBN 1-930110-82-0 [1st edition August 2002]
es: ISBN 1-930110-82-0 [1ª edición - Agosto de 2002]

source: ISBN 978-0-201-65788-3 [2 edition, October 1999]
es: ISBN 978-0-201-65788-3 [2ª edición - Octubre de 1999]

source: ISBN 978-0-596-00027-1 [3rd edition July 2000]
es: ISBN 978-0-596-00027-1 [3ª edición - Julio de 2000]

source: ISBN 978-0-596-00313-5 [2nd Edition August 2003]
es: ISBN 978-0-596-00313-5 [2ª edición - Agosto de 2003]

source: ISBN 978-0-596-00374-6 [4th edition July 2002]
es: ISBN 978-0-596-00374-6 [4ª edición - Julio de 2002]

source: ISBN 978-0-596-00476-7 [December 2003]
es: ISBN 978-0-596-00476-7 [Diciembre de 2003]

source: ISBN 978-0-596-00478-1 [1st edition March 2006]
es: ISBN 978-0-596-00478-1 [1ª edición - Marzo de 2006]

source: ISBN 978-0-596-00503-0 [1st edition January 2004]
es: ISBN 978-0-596-00503-0 [1ª edición - Enero de 2004]

source: ISBN 978-0-596-00639-6 [2nd edition May 2009]
es: ISBN 978-0-596-00639-6 [2ª edición - Mayo de 2009]

source: ISBN 978-0-596-10206-7 [1st edition July 2007]
es: ISBN 978-0-596-10206-7 [1ª edición - Julio de 2007]

source: ISBN 978-0-596-51427-3 [July 2007]
es: ISBN 978-0-596-51427-3 [Julio de 2007]

source: ISBN 978-0-596-52010-6 [5th edition June 2008]
es: ISBN 978-0-596-52010-6 [5ª edición - Junio de 2008]

source: ISBN 978-0-596-52011-3 [5th edition June 2008]
es: ISBN 978-0-596-52011-3 [5ª edición - Junio de 2008]

source: ISBN 978-0-596-52069-4 [May 2009]
es: ISBN 978-0-596-52069-4 [Mayo de 2009]

source: ISBN 978-0-596-52812-6 [3rd edition August 2006]
es: ISBN 978-0-596-52812-6 [3ª edición - Agosto de 2006]

source: ISBN 978-1-56592-699-8 [February 2000]
es: ISBN 978-1-56592-699-8 [Febrero de 2000]

source: ISBN 978-1-56592-716-2 [1st edition January 2002]
es: ISBN 978-1-56592-716-2 [1ª edición - Enero de 2002]

source: ISBN: 1-55860-701-3 [1st edition March 2005]
es: ISBN: 1-55860-701-3 [1ª edición - Marzo de 2005]

source: ISBN: 978-0-596-00173-5 [1st edition July 2005]
es: ISBN: 978-0-596-00173-5 [1ª edición - Julio de 2005]

source: IV also means an internal Integer Value of the type a L</scalar> can hold, not to be confused with an L</NV>.
es: IV también puede ser un valor entero (Integer Value) interno, del tipo que un L</escalar> puede contener. No debe confundirse con un L</NV>.

source: Ideally, a subclass uses the same APIs to access object data that its parent class uses.
es: Idealmente, una subclase usa las mismas API para acceder a los datos del objeto que las usadas por la clase primaria.

source: Identical in every respect to normal capturing parentheses C<()> but for the additional fact that the group can be referred to by name in various regular expression constructs (like C<\g{NAME}>) and can be accessed by name after a successful match via C<%+> or C<%->.
es: Idéntico en todos los sentidos a la captura normal con paréntesis C<()>, pero con la ventaja adicional de que se pueden usar C<%+> o C<%-> para hacer referencia por nombre en distintas construcciones de expresiones regulares (como C<\g{NOMBRE}>) y después de una coincidencia se puede acceder a su contenido a través de C<%+> o C<%->.

source: Identical to C<(?PARNO)> except that the parenthesis to recurse to is determined by name.
es: Idéntico a C<(?PARNO)>, salvo que el paréntesis al que se llega de forma recursiva se determina por su nombre.

source: If you get to choose, it's a good idea to standardize on UTF-8.
es: Si puede elegir, es recomendable utilizar UTF-8 de manera estándar.

source: If you know what version or patchlevel a particular feature was implemented, you can test C<$]> (C<$PERL_VERSION> in C<English>) to see if it will be there.
es: Si sabe en qué versión o nivel de parche se implementó determinada característica, puede comprobar C<$]> (C<$PERL_VERSION> en C<English>) para ver si está incluida.

source: If you turn on the C<use re 'eval'>, though, it is no longer secure, so you should only do so if you are also using taint checking.
es: Sin embargo, deja de ser segura si activa C<use re 'eval'>, por lo que solo se debe usar para realizar comprobaciones de seguridad.

source: If you want your program to be readable, consider supplying the argument.
es: Si desea que su programa sea legible, debería proporcionar explícitamente los argumentos.

source: If you're lucky, they'll even send you patches.
es: Con suerte, hasta le enviarán parches.

source: If your standard I/O package is doing block buffering and you want it to L</flush> the buffer more often, just set the C<$|> variable to a true value.
es: Si el paquete de E/S estándar realiza almacenamiento en búfer de bloques y desea que L<vuelque|/vaciar> el búfer más a menudo, debe establecer la variable C<$|> en un valor verdadero.

source: If @foo doesn't otherwise exist, then it's obviously a character class.
es: Si @foo no existe, entonces es evidente que se trata de una clase de caracteres.

source: If @foo exists, Perl takes a good guess about C<[bar]>, and is almost always right.
es: Si @foo existe, Perl tiene una buena pista acerca de C<[bar]>, y casi siempre acierta.

source: If C<$thing> doesn't contain a reference to a blessed object, the C<blessed> function returns C<undef>.
es: Si C<$algo> no contiene una referencia a un objeto bendecido, la función C<blessed> devuelve C<undef>.

source: If C<$thing> refers to an object, then this function returns the name of the package the object has been blessed into.
es: Si C<$algo> hace referencia a un objeto, esta función devuelve el nombre del paquete en el que se bendijo el objeto.

source: If C<A> and C<A'> coincide: C<AB> is a better match than C<AB'> if C<B> is a better match for C<T> than C<B'>.
es: Si C<A> y C<A'> coinciden: C<AB> es una coincidencia mejor que C<AB'> si C<B> es una coincidencia mejor que C<B'> para C<T>.

source: If C<A> is a better match for C<S> than C<A'>, C<AB> is a better match than C<A'B'>.
es: Si C<A> es una coincidencia mejor que C<A'> para C<S>, C<AB> es una coincidencia mejor que C<A'B'>.

source: If C does not define the method, but C<File> does, then Perl calls the method in C<File>.
es: Si la clase C no define el método, pero sí lo hace la clase C<Archivo>, entonces Perl llamará al método de la clase C<Archivo>.

source: If C<File> inherited from C<DataSource>, which inherited from C<Thing>, then Perl would keep looking "up the chain" if necessary.
es: Si C<Archivo> hereda de C<OrigenDatos>, que hereda a su vez de C<Cosa>, entonces Perl deberá subir siguiendo la cadena, si es necesario.

source: If C<use locale> is in effect, and POSIX::setlocale() has been called, the character used for the decimal separator is affected by the LC_NUMERIC locale.
es: Si C<use locale> está activo y se llama a POSIX::setlocale(), la configuración regional LC_NUMERIC determina el carácter que se utiliza como separador decimal.

source: If I<not> used in this way, the result of evaluation of C<code> is put into the special variable C<$^R>.
es: Si I<no> se usa de esta manera, el resultado de la evaluación de C<código> se asigna a la variable especial C<$^R>.

source: If PARNO is preceded by a plus or minus sign then it is assumed to be relative, with negative numbers indicating preceding capture groups and positive ones following.
es: Si PARNO va precedido de un signo más o menos, se supone que es relativo, donde los números negativos indican los grupos de captura anteriores y los positivos indican los posteriores.

source: If Perl cannot find a C<save()> method anywhere in the inheritance hierarchy, it will die.
es: Si Perl no encuentra un método C<guardar()> en ninguna clase de la jerarquía de herencia, el programa finalizará.

source: If Perl cannot find the method in any of these classes, it will die with an error message.
es: Si Perl no puede localizar el método en ninguna de estas clases, el programa finalizará mostrando un mensaje de error.

source: If Perl is new (and thus scary) to them, find something that Perl can do to solve one of their problems.
es: Si nunca han utilizado Perl y se sienten inseguros, busque alguna tarea en la que Perl les pueda ayudar.

source: If a C<(*MARK:NAME)> was encountered while matching, then it is that position which is used as the "skip point".
es: Si se encuentra una construcción C<(*MARK:NOMBRE)> durante la búsqueda de coincidencia, esa será la posición utilizada como "punto de salto".

source: If a filter has been installed with this method, it will be invoked every time you read a key from a DBM database.
es: Si se ha instalado un filtro con este método, se invocará cada vez que se lea una clave de una base de datos DBM.

source: If a filter has been installed with this method, it will be invoked every time you read a value from a DBM database.
es: Si se ha instalado un filtro con este método, se invocará cada vez que se lea un valor de una base de datos DBM.

source: If a filter has been installed with this method, it will be invoked every time you write a key to a DBM database.
es: Si se ha instalado un filtro con este método, se invocará cada vez que se escriba una clave en una base de datos DBM.

source: If a filter has been installed with this method, it will be invoked every time you write a value to a DBM database.
es: Si se ha instalado un filtro con este método, se invocará cada vez que se escriba un valor en una base de datos DBM.

source: If a pattern does not contain a special backtracking verb that allows an argument, then C<$REGERROR> and C<$REGMARK> are not touched at all.
es: Si un patrón no contiene un verbo especial de vuelta atrás que admita un argumento, no se modifican los valores de C<$REGERROR> y C<$REGMARK>.

source: If a tied hash is evaluated in scalar context, the C<SCALAR> method is called (with a fallback to C<FIRSTKEY>).
es: Si se evalúa un hash enlazado en contexto de escalar, se llama al método C<SCALAR> (con una retrollamada a C<FIRSTKEY>).

source: If a typo (or worse) sneaks into a commit to blead or maint-*, we'll fix it in another commit.
es: Si se colara un error ortográfico (o algo más grave) en una confirmación en blead o maint-*, lo corregiremos en una confirmación posterior.

source: If all data that comes from a certain handle is encoded in exactly the same way, you can tell the PerlIO system to automatically decode everything, with the C<encoding> layer.
es: Si todos los datos de un determinado identificador de archivo se codifican exactamente de la misma manera, puede ordenar al sistema de entrada/salida de Perl que descodifique todo automáticamente mediante la capa C<encoding>.
